frontend/controllers/ComController.php

    protected function findModel($id)
    {
        if (($model = Computer::findOne($id)) !== null) {
---
SELECT * FROM `computer` WHERE `id`='1'