frontend/controllers/ComDepController.php

    protected function findModel($id)
    {
        if (($model = ComDep::findOne($id)) !== null) {
---
SELECT * FROM `com_dep` WHERE `id`='1'