frontend/views/com-dep/_form.php

SELECT `id`, concat("COMID: ",id, " หมายเลข: " ,code) as name FROM `computer`
---
            <?php

                //$form->field($model, 'com_id')->textInput()
                $dataCategory = ArrayHelper::map(Computer::find()->select(['id','concat("COMID: ",id, " หมายเลข: " ,code) as name'])->asArray()->all(), 'id', 'name');

SELECT * FROM `department`
---

            <?php
                //$form->field($model, 'dep_id')->textInput()
                $dataCategory = ArrayHelper::map(Department::find()->asArray()->all(), 'id', 'name');