frontend/views/com/_form.php

SELECT * FROM `com_type`
---
        //$form->field($model, 'com_type_id')->textInput();
       //echo  Html::activeDropDownList($model, 'com_type_id',  yii\helpers\ArrayHelper::map(ComType::find()->all(), 'id', 'name'));

    $dataCategory = ArrayHelper::map(ComType::find()->asArray()->all(), 'id', 'name');

SELECT * FROM `os_type`
---

    <?php
        //$form->field($model, 'os')->textInput(['maxlength' => true])
        $dataCategory = ArrayHelper::map(OsType::find()->asArray()->all(), 'id', 'name');

SELECT * FROM `arch_type`
---

    <?php
        //$form->field($model, 'arch_type_id')->textInput()
        $dataCategory = ArrayHelper::map(ArchType::find()->asArray()->all(), 'id', 'name');