frontend/views/com/index.php

            'headerRowOptions'=>['class'=>'kartik-sheet-style'],
            'filterRowOptions'=>['class'=>'kartik-sheet-style'],
        'pjax'=>true,
        'columns' => [
            [
                'class' => 'yii\grid\SerialColumn',
                'contentOptions'=>['class'=>'kartik-sheet-style'],
                //'width' => '36px',
                'header'=> '',
                'headerOptions'=>['class'=>'kartik-sheet-style'],
                'options'=>['style'=>'width:40px'],
            ],

            //'id',
            [
                'attribute'=>'code',
                //'value'=>$model->code,
                'filterType'=>GridView::FILTER_SELECT2,
                'filter'=>ArrayHelper::map(frontend\models\Computer::find()->groupBy('code')->asArray()->all(), 'code', 'code'),
                'filterWidgetOptions'=>[
                    'pluginOptions'=>['allowClear'=>true],
                        ],
                        'filterInputOptions'=>['placeholder'=>'หมายเลขครุภัณฑ์'],
                        'format'=>'raw'
                        ],

---
SELECT * FROM `computer` LIMIT 20